sjasonsmith/Marlin/Marlin/src/HAL/STM32/timers.cpp
/**
 * Marlin 3D Printer Firmware
 *
 * Copyright (c) 2020 MarlinFirmware [https://github.com/MarlinFirmware/Marlin]
 * Copyright (c) 2016 Bob Cousins bobcousins42@googlemail.com
 * Copyright (c) 2015-2016 Nico Tonnhofer wurstnase.reprap@gmail.com
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 */
#if defined(ARDUINO_ARCH_STM32) && !defined(STM32GENERIC)

#include "../../inc/MarlinConfig.h"

// ------------------------
// Local defines
// ------------------------

// Default timer priorities. Override by specifying alternate priorities in the board pins file.
// The TONE timer is not present here, as it currently cannot be set programmatically. It is set
// by defining TIM_IRQ_PRIO in the variant.h or platformio.ini file, which adjusts the default
// priority for STM32 HardwareTimer objects.
#define SWSERIAL_TIMER_IRQ_PRIO_DEFAULT  1 // Requires tight bit timing to communicate reliably with TMC drivers
#define SERVO_TIMER_IRQ_PRIO_DEFAULT     1 // Requires tight PWM timing to control a BLTouch reliably
#define STEP_TIMER_IRQ_PRIO_DEFAULT      2
#define TEMP_TIMER_IRQ_PRIO_DEFAULT     14 // Low priority avoids interference with other hardware and timers

#ifndef STEP_TIMER_IRQ_PRIO
  #define STEP_TIMER_IRQ_PRIO STEP_TIMER_IRQ_PRIO_DEFAULT
#endif
#ifndef TEMP_TIMER_IRQ_PRIO
  #define TEMP_TIMER_IRQ_PRIO TEMP_TIMER_IRQ_PRIO_DEFAULT
#endif
#if HAS_TMC_SW_SERIAL
  #include <SoftwareSerial.h>
  #ifndef SWSERIAL_TIMER_IRQ_PRIO
    #define SWSERIAL_TIMER_IRQ_PRIO SWSERIAL_TIMER_IRQ_PRIO_DEFAULT
  #endif
#endif
#if HAS_SERVOS
  #include "Servo.h"
  #ifndef SERVO_TIMER_IRQ_PRIO
    #define SERVO_TIMER_IRQ_PRIO SERVO_TIMER_IRQ_PRIO_DEFAULT
  #endif
#endif
#if ENABLED(SPEAKER)
  // Ensure the default timer priority is somewhere between the STEP and TEMP priorities.
  // The STM32 framework defaults to interrupt 14 for all timers. This should be increased so that
  // timing-sensitive operations such as speaker output are not impacted by the long-running
  // temperature ISR. This must be defined in the platformio.ini file or the board's variant.h,
  // so that it will be consumed by framework code.
  #if !(TIM_IRQ_PRIO > STEP_TIMER_IRQ_PRIO && TIM_IRQ_PRIO < TEMP_TIMER_IRQ_PRIO)
    #error "Default timer interrupt priority is unspecified or set to a value which may degrade performance."
  #endif
#endif

// Convert from timer number to timer name, such as "TIM1"
#define _TIMER_DEV(X) TIM##X
#define TIMER_DEV(X) _TIMER_DEV(X)

// ------------------------
// Automatic timer selection for STEP / TEMP ISRs
// ------------------------

// This list is based on the framework code in SoftwareSerial.cpp, which attempts to select the
// timer least likely to be used on the system. This roughly correlates to how many external pins
// these connect to, and how uncommon they are across MCU lines. Use this as the fallback order
// if a match cannot be found the the MCU-specific list.
// static constexpr uintptr_t default_preferred_timers[] = {
static constexpr struct {uintptr_t base_address; int timer_number; } default_preferred_timers[] = {
  #if defined (TIM18_BASE)
    {uintptr_t(TIM18), 18},
  #endif
  #if defined (TIM7_BASE)
    {uintptr_t(TIM7), 7},
  #endif
  #if defined (TIM6_BASE)
    {uintptr_t(TIM6), 6},
  #endif
  #if defined (TIM22_BASE)
    {uintptr_t(TIM22), 22},
  #endif
  #if defined (TIM21_BASE)
    {uintptr_t(TIM21), 21},
  #endif
  #if defined (TIM17_BASE)
    {uintptr_t(TIM17), 17},
  #endif
  #if defined (TIM16_BASE)
    {uintptr_t(TIM16), 16},
  #endif
  #if defined (TIM15_BASE)
    {uintptr_t(TIM15), 15},
  #endif
  #if defined (TIM14_BASE)
    {uintptr_t(TIM14), 14},
  #endif
  #if defined (TIM13_BASE)
    {uintptr_t(TIM13), 13},
  #endif
  #if defined (TIM11_BASE)
    {uintptr_t(TIM11), 11},
  #endif
  #if defined (TIM10_BASE)
    {uintptr_t(TIM10), 10},
  #endif
  #if defined (TIM12_BASE)
    {uintptr_t(TIM12), 12},
  #endif
  #if defined (TIM19_BASE)
    {uintptr_t(TIM19), 19},
  #endif
  #if defined (TIM9_BASE)
    {uintptr_t(TIM9), 9},
  #endif
  #if defined (TIM5_BASE)
    {uintptr_t(TIM5), 5},
  #endif
  #if defined (TIM4_BASE)
    {uintptr_t(TIM4), 4},
  #endif
  #if defined (TIM3_BASE)
    {uintptr_t(TIM3), 3},
  #endif
  #if defined (TIM2_BASE)
    {uintptr_t(TIM2), 2},
  #endif
  #if defined (TIM20_BASE)
    {uintptr_t(TIM20), 20},
  #endif
  #if defined (TIM8_BASE)
    {uintptr_t(TIM8), 8},
  #endif
  #if defined (TIM1_BASE)
    {uintptr_t(TIM1), 1}
  #endif
};

// Convert from a timer base address to its integer timer number.
static constexpr int get_timer_num_from_base_address(uintptr_t base_address) {
  for (const auto &timer : default_preferred_timers)
    if (timer.base_address == base_address) return timer.timer_number;
  return 0;
}

// The platform's SoftwareSerial.cpp will use the first timer from default_preferred_timers.
#if HAS_TMC_SW_SERIAL && !defined(TIMER_SERIAL)
  constexpr auto TIMER_SERIAL = default_preferred_timers[0].timer_number;
#endif

// Provide a customized preferred timer order that is MCU-specific.
#if defined(STM32F1xx)
  // Customized preferences for F1 chips. Not all timers exist on all models.
  // This favors historic precedent to hopefully avoid fan conflcits.
  // TIM6/7 - Basic timers with no pin connections. Cannot conflict with fans.
  // TIM5   - Previous default in STM32F1 HAL, most likely free on most boards
  // TIM2   - Previous default in both STM32 and STM32F1 HALs
  // TIM4   - Previous default in STM32 HAL and for value-line chips in STM32F1 HAL
  static constexpr uintptr_t mcu_preferred_timers[] = {
    #if defined (TIM6_BASE)
      uintptr_t(TIM6),
    #endif
    #if defined (TIM7_BASE)
      uintptr_t(TIM7),
    #endif
    #if defined (TIM5_BASE)
      uintptr_t(TIM5),
    #endif
    uintptr_t(TIM2),
    uintptr_t(TIM4),
    };
#elif defined(STM32F0xx) || defined(STM32F4xx) || defined(STM32F7xx)
  // default selection order is fine
  static constexpr uintptr_t mcu_preferred_timers[] = {0};
#else
  #error "MCU not yet supported in this HAL"
#endif

static constexpr uintptr_t timers_already_in_use[] = {
    #if HAS_TMC_SW_SERIAL
      uintptr_t(TIMER_SERIAL),  // Set in variant.h, or as a define in platformio.h if not present in variant.h
    #endif
    #if ENABLED(SPEAKER)
      uintptr_t(TIMER_TONE),    // Set in variant.h, or as a define in platformio.h if not present in variant.h
    #endif
    #if HAS_SERVOS
      uintptr_t(TIMER_SERVO),   // Set in variant.h, or as a define in platformio.h if not present in variant.h
    #endif
    #ifdef STEP_TIMER
      uintptr_t(TIMER_DEV(STEP_TIMER)),
    #endif
    #ifdef TEMP_TIMER
      uintptr_t(TIMER_DEV(TEMP_TIMER)),
    #endif
    0u
  };

static constexpr bool is_timer_in_use(uintptr_t base_address) {
  for (auto timer_in_use : timers_already_in_use)
    if (timer_in_use && timer_in_use == base_address) return true;
  return false;
}

static constexpr bool is_timer_in_mcu_preferred_list(uintptr_t base_address) {
  for (auto preferred_timer : mcu_preferred_timers)
    if (preferred_timer && preferred_timer == base_address) return true;
  return false;
}

// Choose an available timer. 1-indexed instance allows skipping already used timers.
static constexpr uintptr_t get_free_timer(int instance) {
  int found = 0;
  // First check for an available timer in the MCU-preferred list
  for (auto timer : mcu_preferred_timers)
    if (timer && !is_timer_in_use(timer) && instance == ++found)
      return timer;
  // Fall back to the default list if a timer cannot be found on the MCU-preferred list
  for (auto timer : default_preferred_timers)
    if (timer.base_address && !is_timer_in_use(timer.base_address) && !is_timer_in_mcu_preferred_list(timer.base_address) && instance == ++found)
      return timer.base_address;
  return 0;
}

// Select free timers for STEP and TEMP, if not already specified by the pins file
#ifdef STEP_TIMER
  #define TEMP_TIMER_SEARCH_INDEX 1
  #define STEP_TIMER_DEV TIMER_DEV(STEP_TIMER)
#else
  constexpr uintptr_t MCU_STEP_TIMER = get_free_timer(1);
  static_assert(0u != MCU_STEP_TIMER, "Available timer could not be found for STEP_TIMER");
  #define TEMP_TIMER_SEARCH_INDEX 2
  #define STEP_TIMER_DEV ((TIM_TypeDef*)(MCU_STEP_TIMER))
#endif
#ifdef TEMP_TIMER
  #define TEMP_TIMER_DEV TIMER_DEV(TEMP_TIMER)
#else
  constexpr uintptr_t MCU_TEMP_TIMER = get_free_timer(TEMP_TIMER_SEARCH_INDEX);
  static_assert(0u != MCU_TEMP_TIMER, "Available timer could not be found for TEMP_TIMER");
  #define TEMP_TIMER_DEV ((TIM_TypeDef*)(MCU_TEMP_TIMER))
#endif


// constexpr doesn't like using the base address pointers that timers evaluate to.
// We can get away with casting them to uintptr_t, if we do so inside an array.
// For some reason GCC will not do it directly to an integer.
#ifdef HAS_TMC_SW_SERIAL
  static constexpr uintptr_t timer_serial_arr[] = {uintptr_t(TIMER_SERIAL)};
  static constexpr uintptr_t timer_serial = timer_serial_arr[0];
#endif
#if ENABLED(SPEAKER)
  static constexpr uintptr_t timer_tone_arr[] = {uintptr_t(TIMER_TONE)};
  static constexpr uintptr_t timer_tone = timer_tone_arr[0];
#endif
#if HAS_SERVOS
  static constexpr uintptr_t timer_servo_arr[] = {uintptr_t(TIMER_SERVO)};
  static constexpr uintptr_t timer_servo = timer_servo_arr[0];
#endif

enum TimerPurpose { TP_SERIAL, TP_TONE, TP_SERVO, TP_STEP, TP_TEMP };

// Final list of timers, to enable checking for conflicts.
// Includes the purpose of each timer to ease debugging when evaluating at build-time.
static constexpr struct { TimerPurpose p; int t; } final_timers_in_use[] = {
  #if HAS_TMC_SW_SERIAL
    {TimerPurpose::TP_SERIAL, get_timer_num_from_base_address(timer_serial)},  // Set in variant.h, or as a define in platformio.h if not present in variant.h
  #endif
  #if ENABLED(SPEAKER)
    {TimerPurpose::TP_TONE, get_timer_num_from_base_address(timer_tone)},    // Set in variant.h, or as a define in platformio.h if not present in variant.h
  #endif
  #if HAS_SERVOS
    {TimerPurpose::TP_SERVO, get_timer_num_from_base_address(timer_servo)},   // Set in variant.h, or as a define in platformio.h if not present in variant.h
  #endif
  #ifdef STEP_TIMER
    {TimerPurpose::TP_STEP, STEP_TIMER},
  #else
    {TimerPurpose::TP_STEP, get_timer_num_from_base_address(MCU_STEP_TIMER)},
  #endif
  #ifdef TEMP_TIMER
    {TimerPurpose::TP_TEMP, TEMP_TIMER},
  #else
    {TimerPurpose::TP_TEMP, get_timer_num_from_base_address(MCU_TEMP_TIMER)},
  #endif
};

// This does NOT account for PWM outputs such as fans, lasers, etc. When they
// are available at build-time this automatic timer selection should be updated.
static constexpr bool verify_no_timer_conflicts() {
  LOOP_L_N(i, COUNT(final_timers_in_use))
    LOOP_S_L_N(j, i + 1, COUNT(final_timers_in_use))
      if (final_timers_in_use[i].t == final_timers_in_use[j].t) return false;
  return true;
}

// If this assertion fails at compile time, review the final_timers_in_use array.
// If default_envs is defined properly in platformio.ini, VS Code can evaluate the array
// when hovering over it, making it easy to identify the conflicting timers.
static_assert(verify_no_timer_conflicts(), "One or more timer conflict detected");

static constexpr int pins_used_by_runtime_pwm[] = {
  #if ENABLED(CASELIGHT_USES_BRIGHTNESS) && DISABLED(CASE_LIGHT_USE_NEOPIXEL)
    CASE_LIGHT_PIN,
  #endif
  #if ENABLED(USE_CONTROLLER_FAN)
    CONTROLLER_FAN_PIN, // Does not currently support FAN_SOFT_PWM
  #endif
  #if ENABLED(SPINDLE_LASER_PWM)
    SPINDLE_LASER_PWM_PIN,
  #endif
  #if EITHER(RGB_LED, RGBW_LED)
    RGB_LED_R_PIN, RGB_LED_G_PIN, RGB_LED_B_PIN,
    #if ENABLED(RGBW_LED)
      RGB_LED_W_PIN,
    #endif
  #endif
  #if PIN_EXISTS(LED)
    LED_PIN,
  #endif
  #if DISABLED(FAN_SOFT_PWM)
    #if HAS_FAN0
      FAN_PIN,
    #endif
    #if HAS_FAN1
      FAN1_PIN,
    #endif
    #if HAS_FAN2
      FAN2_PIN,
    #endif
    #if HAS_FAN3
      FAN3_PIN,
    #endif
    #if HAS_FAN4
      FAN4_PIN,
    #endif
    #if HAS_FAN5
      FAN5_PIN,
    #endif
    #if HAS_FAN6
      FAN6_PIN,
    #endif
    #if HAS_FAN7
      FAN7_PIN,
    #endif
  #endif
  #if HAS_MOTOR_CURRENT_PWM
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_X)
      MOTOR_CURRENT_PWM_X_PIN,
    #endif
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_Y)
      MOTOR_CURRENT_PWM_Y_PIN,
    #endif
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_XY)
      MOTOR_CURRENT_PWM_XY_PIN,
    #endif
    break;
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_Z)
      MOTOR_CURRENT_PWM_Z_PIN,
    #endif
    break;
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_E)
      MOTOR_CURRENT_PWM_E_PIN,
    #endif
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_E0)
      MOTOR_CURRENT_PWM_E0_PIN,
    #endif
    #if PIN_EXISTS(MOTOR_CURRENT_PWM_E1)
      MOTOR_CURRENT_PWM_E1_PIN,
    #endif
  #endif
  #if ENABLED(BARICUDA)
    #if HAS_HEATER_1
      HEATER_1_PIN,
    #endif
    #if HAS_HEATER_2
      HEATER_2_PIN,
    #endif
  #endif
  #if ENABLED(USE_CONTROLLER_FAN)
    CONTROLLER_FAN_PIN,
  #endif

  // I don't think any AUTO fans use SOFT_PWM
  #if HAS_AUTO_FAN_0
    E0_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_1
    E1_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_2
    E2_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_3
    E3_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_4
    E4_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_5
    E5_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_6
    E6_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_FAN_7
    E7_AUTO_FAN_PIN,
  #endif
  #if HAS_AUTO_CHAMBER_FAN
    CHAMBER_AUTO_FAN_PIN,
  #endif
};


// ------------------------
// Private Variables
// ------------------------

HardwareTimer *timer_instance[NUM_HARDWARE_TIMERS] = { nullptr };

// ------------------------
// Public functions
// ------------------------

uint32_t GetStepperTimerClkFreq() {
  // Timer input clocks vary between devices, and in some cases between timers on the same device.
  // Retrieve at runtime to ensure device compatibility. Cache result to avoid repeated overhead.
  static uint32_t clkfreq = timer_instance[STEP_TIMER_NUM]->getTimerClkFreq();
  return clkfreq;
}

// frequency is in Hertz
void HAL_timer_start(const uint8_t timer_num, const uint32_t frequency) {
  if (!HAL_timer_initialized(timer_num)) {
    switch (timer_num) {
      case STEP_TIMER_NUM: // STEPPER TIMER - use a 32bit timer if possible
        timer_instance[timer_num] = new HardwareTimer(STEP_TIMER_DEV);
        /* Set the prescaler to the final desired value.
         * This will change the effective ISR callback frequency but when
         * HAL_timer_start(timer_num=0) is called in the core for the first time
         * the real frequency isn't important as long as, after boot, the ISR
         * gets called with the correct prescaler and count register. So here
         * we set the prescaler to the correct, final value and ignore the frequency
         * asked. We will call back the ISR in 1 second to start at full speed.
         *
         * The proper fix, however, would be a correct initialization OR a
         * HAL_timer_change(const uint8_t timer_num, const uint32_t frequency)
         * which changes the prescaler when an IRQ frequency change is needed
         * (for example when steppers are turned on)
         */

        timer_instance[timer_num]->setPrescaleFactor(STEPPER_TIMER_PRESCALE); //the -1 is done internally
        timer_instance[timer_num]->setOverflow(_MIN(hal_timer_t(HAL_TIMER_TYPE_MAX), (GetStepperTimerClkFreq()) / (STEPPER_TIMER_PRESCALE) /* /frequency */), TICK_FORMAT);
        break;
      case TEMP_TIMER_NUM: // TEMP TIMER - any available 16bit timer
        timer_instance[timer_num] = new HardwareTimer(TEMP_TIMER_DEV);
        // The prescale factor is computed automatically for HERTZ_FORMAT
        timer_instance[timer_num]->setOverflow(frequency, HERTZ_FORMAT);
        break;
    }

    // Disable preload. Leaving it default-enabled can cause the timer to stop if it happens
    // to exit the ISR after the start time for the next interrupt has already passed.
    timer_instance[timer_num]->setPreloadEnable(false);

    HAL_timer_enable_interrupt(timer_num);

    // Start the timer.
    timer_instance[timer_num]->resume(); // First call to resume() MUST follow the attachInterrupt()

    // This is fixed in Arduino_Core_STM32 1.8.
    // These calls can be removed and replaced with
    // timer_instance[timer_num]->setInterruptPriority
    switch (timer_num) {
      case STEP_TIMER_NUM:
        timer_instance[timer_num]->setInterruptPriority(STEP_TIMER_IRQ_PRIO, 0);
        break;
      case TEMP_TIMER_NUM:
        timer_instance[timer_num]->setInterruptPriority(TEMP_TIMER_IRQ_PRIO, 0);
        break;
    }
  }
}

void HAL_timer_enable_interrupt(const uint8_t timer_num) {
  if (HAL_timer_initialized(timer_num) && !timer_instance[timer_num]->hasInterrupt()) {
    switch (timer_num) {
      case STEP_TIMER_NUM:
        timer_instance[timer_num]->attachInterrupt(Step_Handler);
        break;
      case TEMP_TIMER_NUM:
        timer_instance[timer_num]->attachInterrupt(Temp_Handler);
        break;
    }
  }
}

void HAL_timer_disable_interrupt(const uint8_t timer_num) {
  if (HAL_timer_initialized(timer_num)) timer_instance[timer_num]->detachInterrupt();
}

bool HAL_timer_interrupt_enabled(const uint8_t timer_num) {
  return HAL_timer_initialized(timer_num) && timer_instance[timer_num]->hasInterrupt();
}

void SetTimerInterruptPriorities() {
  TERN_(HAS_TMC_SW_SERIAL, SoftwareSerial::setInterruptPriority(SWSERIAL_TIMER_IRQ_PRIO, 0));
  TERN_(HAS_SERVOS, libServo::setInterruptPriority(SERVO_TIMER_IRQ_PRIO, 0));
}


#endif // ARDUINO_ARCH_STM32 && !STM32GENERIC
